[M_IrisEp1_HighwayToHell MissionDefinition]
MissionDescription="Mister Torgue invited you to the [place]Badass Crater of Badassitude[-place], and you came. You're here to fight the biggest badasses on Pandora for a shot at opening a Vault full of loot (and we promise, it's ACTUALLY full of loot this time).<br><br>Before you can get started, however, you'll need to sign the Torgue corporation's legal waiver."
TurnInDescription="You're at the Arena, and you've got a sponsor. It's time to start the tournament!"

[M_IrisEp1_HighwayToHell:MissionObjectiveSetDefinition_1 MissionObjectiveSetDefinition]
MissionDescriptionOverride="Mister Torgue invited you to the [place]Badass Crater of Badassitude[-place], and you came. You're here to fight the biggest badasses on Pandora for a shot at opening a Vault full of loot (and we promise, it's ACTUALLY full of loot this time).<br><br>Now that you're at the Arena, you just need to get rid of some of the other competitors outside."

[M_IrisEp1_HighwayToHell:MissionObjectiveSetDefinition_2 MissionObjectiveSetDefinition]
MissionDescriptionOverride="Mister Torgue invited you to the [place]Badass Crater of Badassitude[-place], and you came. You're here to fight the biggest badasses on Pandora for a shot at opening a Vault full of loot (and we promise, it's ACTUALLY full of loot this time).<br><br>Before you can actually compete in the Arena, however, you'll need a sponsor. Piston, the number one gladiator on the Torgue leaderboards, has offered to sponsor you. He's asked you to meet up with him."

[M_IrisEp1_HighwayToHell:MissionObjectiveSetDefinition_3 MissionObjectiveSetDefinition]
MissionDescriptionOverride="Mister Torgue invited you to the [place]Badass Crater of Badassitude[-place], and you came. You're here to fight the biggest badasses on Pandora for a shot at opening a Vault full of loot (and we promise, it's ACTUALLY full of loot this time).<br><br>You need to head to the Arena to enter yourself in the tournament."

[M_IrisEp1_WTTJ MissionDefinition]
MissionDescription="Welcome to the [place]Torgue Arena[-place]! You've got a sponsor -- a hulking bag of muscles and anger named Piston -- and now it's time to enroll in your first event. Piston has asked you to head to the nearby battle board and sign up."
TurnInDescription="Now that the paperwork's all done with, it's time to bust some heads."
